kysilv/z80-rp2350b-zx-compatible/firmware/src/Pin_defs.h
#define Y0 0
#define INT 14
#define Z80Reset 15

#define Q0 16
#define Q1 17
#define Q2 18
#define Q3 19
#define Q4 20
#define Q5 21
#define Q6 22
#define Q7 23

#define CWE 24
#define UCS 25
#define UBUS 26
#define VRAMCS 27
#define IORQ 28
#define A0 29
#define URD 30
#define MIC 31
#define EAR 32
#define KB1 33
#define KB2 34
#define KB3 35
#define KB4 36
#define KB5 37
#define UCLK 38
#define TAPE 39

#define VGA_B 40
#define VGA_R 41
#define VGA_G 42
#define BRIGHT 43
#define DE 44
#define PXLCLK 45
#define HSYNC 46
#define VSYNC 47

